CSI API ETABS v1

# eObjType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eObjType

    Public Enumeration eObjType

    Dim instance As eObjType

    public enum class eObjType

    type eObjType

Members

| Member name| Value| Description
---|---|---|---
| Point| 1|
| Frame| 2|
| Area| 3|
| Solid| 6|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com